Repository: xsawyerx/moose-website
Catalog: lib/Moose/Website/I18N/po/*.po
Languages: he

source: header moose
he: מוס

source: header moose subtitle
he: מערכת אובייקטים פוסט-מודרנית עבור פרל

source: moose page title
he: מוס - מערכת אובייקטים פוסט-מודרנית עבור פרל

source: nav home
he: ראשי

source: nav blog
he: בלוג

source: nav about
he: אודות

source: nav articles
he: מאמרים

source: nav download
he: הורדה

source: nav support
he: תמיכה

source: nav presentations
he: מצגות

source: home body
he: <p>מוס היא <a href='http://www.perl.com/pub/a/1999/03/pm.html'>מערכת אובייקטים פוסט-מודרנית</a> עבור פרל 5 אשר מפגיה את השעמום שבכתיבת פרל מונחה-עצמים. מוס משאילה את היכולות הטובות ביותר מפרל 6, <acronym title='Common Lisp Object System'>CLOS</acronym> (ליספ), סמאל-טוק, ג'אווה, בטא, אוקאמל, רובי ועוד, תוך כדי שמירת נאמנות למקורותיה של פרל 5.</p><p>מוס מוכנה ב-100% לשימוש מלא ונעשה בה שימוש נרחב במספר מערכות הגודל מיום ליום. <a href='http://search.cpan.org/dist/Moose'>נסו אותה היום!</a></p>

source: about body
he: <p>מוס היא הרחבה של מערכת האובייקטים של פרל 5. המטרה העיקרית של מוס היא להפוך תכנות מובנה עצמים בפרל 5 לקל יותר, עקבי יותר ופחות מעייף. עם מוס אפשר לחשוב יותר על מה רוצים לעשות ופחות על המכניקה של <acronym title='object-oriented programming'>תוכנות מובנה עצמים</acronym>.</p><p><a href='#code_sample' rel='facebox'>דוגמה של קוד מוס</a>.</p>

source: about new to moose header
he: חדש/ה למוס?

source: about new to moose body
he: <p>אם אינך מכיר/ה את מוס, המקום הטוב ביותר להתחיל בו הוא במסמכים של<a href='http://search.cpan.org/dist/Moose/lib/Moose/Manual.pod'><code>Moose::Manual</code></a>, ולאחר מכן לעבור על דוגמאות קוד במסמך <a href='http://search.cpan.org/dist/Moose/lib/Moose/Cookbook.pod'><code>Moose::Cookbook</code></a>. ההקדמה תראה לך מהו מוס, ואיך הוא הופך את תכנות מונחה עצמים (<acronym title='object orientation'>OO</acronym>) של פרל 5 לטוב יותר.</p><p>המתכונים שבספר המתכונים מוס יעזורו לך להבין הרבה מהיכולות של מוס מהר. ברגע שתתחיל/י להבין מה מוס יכול לעשות, תוכל/י להשתמש בתיעוד של <acronym title='application programming interface'>הממשק לתכנות מחשבים (API)</acronym> לקבל עוד מידע לגבי יכולות נוספות שיעניינו אותך.</p><p>מוס גם כיכבה במספר ספרים:</p><ul><li><a href='http://www.onyxneon.com/books/modern_perl/index.html'>Modern Perl</a></li><li><a href='http://apress.com/book/view/1430223650'>The Definitive Guide to Catalyst</a></li><li><a href='http://perlmoderne.fr/'>Perl Moderne</a></ul>

source: about organization list header
he: ארגונים שמשתמשים במוס

source: about organization list body
he: <p>מספר גדול של ארגונים מסביב לעולם משתמשים במוס, הנה כמה מהם.</p>

source: download body
he: הפצת מוס עצמה

source: download info <code>Task::Moose</code>
he: אוסף של תוספות מצויינות למוס

source: download info <code>Task::Kensho</code>
he: אוסף של מודולי פרל מודרניים מעולים

source: download info <code>MooseX::*</code>
he: התוספות של מוס

source: download git header
he: גיט

source: download git body
he: <p>מוס מפותחת בעזרת מערכת ניהול התוכן <a href='http://git-scm.com/'>גיט (Git)</a>. מוס הוא פרוייקט פתוח מאוד ואנחנו תמיד מוכנים לקבל תרומות מאחרים. המסמך <a href='http://search.cpan.org/dist/Moose/lib/Moose/Manual/Contributing.pod'><code>Moose::Manual::Contributing</code></a> משקף את מדיניות התרומות הספציפית שלנו ומראה לך איך לעבוד עם רצף העבודה שלנו.</p><p>הנה כמה סרטי וידאו הממחישים את הפעילות במאגרי הגיט של <a href='http://www.youtube.com/watch?v=Gwq10W0RaHQ&amp;hd=1'>מוס</a> ושל <a href='http://www.youtube.com/watch?v=HlJDnvNSfJo&amp;hd=1'><code>Class::MOP</code></a> במועד שחרור גרסת 1.0. סרטי הוידאו האלה נוצרו בעזרת התוכנה <a href='http://code.google.com/p/gource/wiki/Videos'>Gource</a>.</p>

source: download git public
he: קישור למאגר הגיט הפומבי

source: download git committer
he: קישור למאגר גיט עבור בעלי גישה

source: download git web view
he: צפיה בגיט בדפדפן

source: download github mirror
he: מראה של הקוד בגיטהאב (GitHub)

source: support body
he: <p>מוס הוא פרוייקט המונע על ידי קהילה ויש מספר מקומות שבהם אפשר למצוא מידע ותמיכה. למטה רשומים ערוצים ה<acronym title='Internet relay chat'>IRC</acronym> הרשמיים ורשימות התפוצה, אבל ניתן למצוא גם עזרה באתרי התמיכה הקהילתיים כמו <a href='http://www.perlmonks.org'>PerlMonks</a> ו-<a href='http://www.stackoverflow.com'>Stack Overflow</a>. אפשר גם לפנות למסמך הרשמי של <a href='http://search.cpan.org/dist/Moose/lib/Moose/Manual/Support.pod'><code>Moose::Manual::Support</code></a> עבור פרטים נוספים.</p>

source: support irc header
he: ערוצי <acronym title='Internet relay chat'>IRC</acronym>

source: support irc body
he: <p>הדרך המהירה ביותר לקבל תמיכה במוס היא ליצור קשר עם הקהילה בערוץ ה-<acronym title='Internet relay chat'>IRC</acronym>.</p>

source: support mailing list header
he: רשימת תפוצה

source: support mailing list body
he: <p>רשימות התפוצה של מוס הן דרך מעולה להשיג תשובות לשאלות שלך.</p>

source: support misc header
he: שונות

source: support misc body
he: <p>הנה מספר דברים שאולי תמצא/י שימושי.</p>

source: support moose mailing list
he: רשימת התפוצה של מוס

source: support moose mailing list archives
he: ארכיון רשימת התפוצה של מוס

source: support textmate bundle
he: חבילת תמיכה של מוס עבור טקסטמייט (TextMate)

source: support quickref card
he: Moose Quick Reference Card

source: articles body
he: <p>למטה ישנה רשימה של מאמרים בפוסטים בבלוגים שנכתבו על מוס, זוהי אינה בשום צורה רשימה מקיפה אבל נו ניסינו לאגד את המעניינים והשימושיים מביניהם. באיסוף הבלוגים של <a href='http://ironman.enlightenedperl.org/'>Perl Iron Man</a> יש לעיתים קרובות פוסטים שקשורים למוס.</p><p>אם את/ה מכיר/ה מאמר או פוסט בבלוג שאת/ה חושב/ת שצריך להיות כלול, נא להודיע לנו בעזרת ערוץ ה-<a href='support.html'><acronym title='Internet relay chat'>IRC</acronym> או ברשימת התפוצה </a> ואנו נוסיף אותו כאן.</p>

source: presentations body
he: <p>למטה ישנם קישורים למצגות שנעשו על מוס בכנסים ובמפגשי קבוצות פרל מקומיות. היכן שניתן ישנו קישור לשקופיות או לוידאו של המצגת.</p><p>זאת בשום צורה לא רשימה מלאה, ולכן אם את/ה מכיר/ה מצגת שאת/ה חושב/ת שצריכה להיות כלולה כאן, אנא להודיע לנו דרך ערוץ ה-<a href='support.html'><acronym title='Internet relay chat'>IRC</acronym> או דרך רשימת בתפוצה</a> ואנחנו נוסיף אותה כאן.</p>

source: presentations video label
he: video

source: presentations podcast label
he: podcast

source: presentations Perl Mongers Groups
he: Perl Mongers Groups

source: footer copyright
he: כל הזכויות שמורות © 2006 – 2010 ל-<a href='http://www.iinteractive.com'>Infinity Interactive</a>

source: footer terms
he: הספריה הזאת הינה תוכנה חופשית; אפשר להפיצה מחדש ו/או לשנותה תחת אותם התאנים של פרל עצמה.
